package com.example.secondassignment;

public class MyData {

    static String[] namePlayerArray = {"אלונה טל", "אילן רוזנפלד", "עודד פז", "קובי פרג'", "דנה פרידר", "ימית סול", "גרי מנדלבאום","נתן קופרמן", "מר לטין", "גברת ברכה"};
    static String[] descriptionArray = {"זמרת ליווי בלהקה. אהובה מאוד על יתר חברי הלהקה, שלא זכו לחיבה דומה ממנה. טרם העונה הרביעית עזבה לארצות הברית, אך הייתה אורחת בכמה פרקים בעונה הרביעית.",
            "קלידן וסולן הלהקה. נוהג להתייאש מכישלונה של הלהקה, ולהיות מריר וביקורתי מאוד. לעיתים נחשב לאדם הכי יציב רגשית בלהקה, ולעיתים נוטה להשתפכויות ילדותיות. ניהל רומן סודי עם ימית בין העונות ובסוף עונה 9 הציע לה נישואין.",
            "מתופף הלהקה. מוצג ככסיל ומאוד ילדותי בעקבות זאת נלעג על ידי דמויות רבות. עודד עובד בזמנו הפנוי בהמבורגרי של גרי, המכנה אותו \"דיביל\". עסק בחומרים רדיואקטיבים בהמבורגרי בין העונות.",
            " הגיטריסט של הלהקה. מגלם גם דמויות נוספות שהן השלכה מאישיותו - הוא מוצג כבעל הפרעת זהות דיסוציאטיבית חמורה, אך הוא נוהג לנצל אותה למטרותיו האישיות. כחלק מפיצול האישיות, מגלם את האמרגן פרדי נייס־טו־מיט, הקשיש העיראקי נג'י קומרדין ג'קסון ועוד. עבד כנהג מונית בין העונות.",
            " בסיסטית בלהקה. עובדת בהמבורגרי בתור מנהלת חשבונות. דנה היא האחיינית של שפרה, אשתו של גרי. בעונות 5-7 גרה עם ימית ולאחר מכן כשנהיית בת זוגו של נתן בעונות 8–9 היא עוברת לגור איתו ביחד בדירתו. בסוף עונה 9 היא ונתן מתחתנים.",
            "נגנית כלי הקשה. בעלת תואר שני בפסיכולוגיה קלינית. בעונה החמישית החלה לעבוד על תזה, ובעונה השביעית החלה לימודי תואר דוקטור. היא ודנה גרו ביחד בעונות 5–7. ניהלה עם אילן רומן סודי בין העונות ובסוף עונה 9 אילן הציע לה נישואין.",
            "הדוד של קובי. בעל מסעדת המבורגרים כושלת בשם \"ההמבורגרי של גרי\" בתחתית הבניין בו גרים הפיג'מות. אדם ממורמר, קמצן, קשוח, ולפעמים ילדותי. שונא את עבודתו ואת הסדרה עצמה, והרבה פעמים רוצה שהיא תסתיים. נוהג לצעוק \"למה?!\" בקול גבוה וצפצפני כאשר צצות בעיות. מאשים את בני משפחתו ברוב הצרות שלו. בעונה החמישית מתברר שיש לו תאום בשם ברי.",
            "בן דודו של אילן שמשמש כ-DJ בלהקה. עבד פעם ב-MTV, אך פוטר בעונה 4. נחשב חכם ומוכשר מאוד, אפילו שמדי פעם מתנהג באופן ילדותי ובוכה הרבה בכל פרק. לאורך כל הסדרה נתן מוצג כאיש אמיד. היה אלוהים בין עונה 5 ל-6. נהיה בן הזוג של דנה החל מעונה 8 והם גרים בעונות 8–9 ביחד בדירתו. בסוף עונה 9 הוא ודנה מתחתנים.",
            "שכן חירש בבניין. גר מול הדירה של שלישיית הפיג'מות, שנוהגים לקחת לו את העיתון של הבוקר. אומר לאורך כל הסדרה רק מילה אחת – \"מה?!\".",
            "שכנה אשכנזייה-אלמנה בבניין. מכונה \"גברת ברכה\". יש לה נכד בשם עופר. נוהגת לארח את נג'י, אחד מפיצולי האישיות של קובי, בדירתה ולהזמין אותו לארוחה. שונאת מאוד את הפיג'מות ומרבה לקרוא להם פושטקים וחוליגנים."};

    static Integer[] photosArray = {R.drawable.alona, R.drawable.ilan, R.drawable.oded,
            R.drawable.kobi, R.drawable.dana, R.drawable.yamit, R.drawable.gery,
            R.drawable.natan, R.drawable.mr_latin, R.drawable.bracha};

    static Integer[] id_ = {0, 1, 2, 3, 4, 5, 6, 7, 8, 9};

}
